#เขียนโปรเเกรม รับชื่อ อายุ ทางแป้นพิมพ์ แล้วแสดงออกมาว่า ชื่อ อายูนี้เป็น คนหนุ่ม หรือคนแก่
# อายุน้อยกว่า คือ เด็ก / อายุ 19 - 45 คนหนุ่ม / 46 คือคนแก่

#หาฟิเจอร์การทำงาน เพื่อจะเอาไปเขียนเป็นฟังชั้น
#ฟีเจอร์ รับค่าข้อมูล , ตรวจสอบและแสดงผลว่าเป็น เด็ก คนหนู่ย คนแก่ , แสดงชื่อโปรแกรม

def showProgramName() :
    print('**--โปรแกรมตรวจสอบความเป็นเด็ก หนุ่ม แก่--**')

def inputData( ) :
    name =input('ป้อมชื่อ :') 
    age =int( input('ป้อนอายุ :'))
    return name, age

def checkShowstatus(name, age) :
    if age <= 18 :
        print(f'คูณ{name} อายุ{age} ปี เป็นเด็ก')
    elif age >= 19 and age <= 45 :
        print(f'คูณ{name} อายุ{age} ปี เป็นคนหนุ่ม') 
    else : 
        print(f'คูณ{name} อายุ{age} ปี เป็นคนแก่')  
   

print('----------------------------')
showProgramName()
print('----------------------------')
name,age = inputData()
checkShowstatus(name, age)
print('----------------------------')